cask_args appdir: '/Applications'

tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'caskroom/homebrew-cask'

# Environment

brew 'coreutils'
brew 'openssl'
brew 'zsh'
brew 'homebrew/dupes/apple-gcc42'

# Tools

brew 'ctags'
brew 'curl'
brew 'exercism'
brew 'fswatch'
brew 'git'
brew 'heroku-toolbelt'
brew 'highlight'
brew 'htop-osx'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'vim'
brew 'watch'

# Ruby

brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rbenv-default-gems'

# Other languages

brew 'go'

# Databases + storage

brew 'redis', restart_service: true
brew 'mysql', restart_service: true

# Fonts

tap 'caskroom/homebrew-fonts'

cask 'font-hack'

# Apps

cask '1password'
cask 'alfred'
cask 'bartender'
cask 'boom'
cask 'cloak'
cask 'cloud'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'isolator'
cask 'iterm2'
cask 'marked'
cask 'moom'
cask 'notational-velocity'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'slack'
cask 'things'

# Appstore applications

mas 'Keynote', id: 409183694
mas 'Tweetbot', id: 557168941
mas 'Tadam', id: 531349534
mas 'Simplenote', id: 692867256
