cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Environment

brew 'coreutils'
brew 'openssl'
brew 'zsh'
brew 'homebrew/dupes/apple-gcc42'

# Tools

brew 'awscli'
brew 'ctags'
brew 'curl'
brew 'fswatch'
brew 'git'
brew 'graphviz'
brew 'heroku'
brew 'highlight'
brew 'htop-osx'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'openconnect'
brew 'the_silver_searcher'
brew 'tig'
brew 'tree'
brew 'vim', args: ['with-override-system-vi']
brew 'watch'

# Ruby

brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-binstubs'
brew 'rbenv-default-gems'

# Other languages

brew 'go'
brew 'gotags'

# Databases, messaging, and storage

brew 'mongodb', restart_service: true
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'rabbitmq', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'

# Fonts

cask 'font-hack'

# Apps

cask '1password'
cask 'alfred'
cask 'bartender'
cask 'boom'
cask 'cloak'
cask 'cloud'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'isolator'
cask 'iterm2'
cask 'marked'
cask 'moom'
cask 'notational-velocity'
cask 'rowanj-gitx'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'things'
cask 'virtualbox'

# Appstore applications

mas 'Keynote', id: 409183694
mas 'Tweetbot', id: 557168941
mas 'Tadam', id: 531349534
mas 'Simplenote', id: 692867256
